Repository: ClnViewer/SpchListBuilder
Catalog: Properties/Resources.*.resx
Languages: ru_ru

# _0_repository_1_contains_2_fil
source: {0} repository {1} contains {2} files
ru_ru: {0} репозиторий {1} содержит {2} объектов

source: _About
ru_ru: _Зачем это

source: _Options
ru_ru: _Настройки

# _unknown_error
source: undefined error
ru_ru: неизвестная ошибка

source: _VCS executables
ru_ru: _Пути к VCS файлам

# _Version
source: Version & revision
ru_ru: _Версия и ревезия

# Add_to
source: Selected to
ru_ru: Выбрать файлы:

source: another process is running
ru_ru: уже запущен процес получения данных

# AppAboutText
source: SPLIT POST COMMIT HOOK allows you to create and maintain a new SVN/GIT/HG repository based on the file list. SpchListBuilder is an application for creating a list of files for the SPCH based on the repository. More information is available on the links below:
ru_ru: SPLIT POST COMMIT HOOK позволяет создавать и поддерживать новый репозиторий SVN/GIT/HG на основании списка файлов. SpchListBuilder является приложением для создания списка файлов для SPCH на основе репозитория. Более подробная информация доступна по ссылкам приведенным ниже:

# commit_0_1_2_3
source: commit: : [{0}/{1}] : {2} : ({3}) {4}
ru_ru: фиксирован: [{0}/{1}] : {2} : ({3}) {4}

# data_filed_count_is_0_abor
source: data no fields, repo is empty?
ru_ru: данные не имеют записей, репозиторий пуст?

# data_serialization_error_a
source: data is not serialized
ru_ru: данные не могут быть преобразованы

source: Data Task:
ru_ru: Поток получения данных:

source: Default expand view repository
ru_ru: Развернутый просмотр списка

source: Disabled
ru_ru: Отключено

source: Enabled
ru_ru: Включено

# Error0
source: Error:
ru_ru: Ошибка:

# Exec_0_EXPORT_Setup_data_not_v
source: Exec: {0} -> EXPORT Setup data not valid options
ru_ru: Выполнение: {0} -> EXPORT данные для этого действия недосточны

# Exec_0_Setup_data_not_valid_la
source: Exec: {0} -> Setup data not valid label: {1}
ru_ru: Выполнение: {0} -> данные для этого действия неимеют нужной метки: {1}

# exec_file_not_found
source: VCS binary file not found
ru_ru: исполняемый файл VCS отсутствует

source: Exec: Setup data is not OK
ru_ru: Выполнение: Установка данных выполнена с ошибкой

source: export
ru_ru: экспорт

# Export_Task
source: Export Data:
ru_ru: Поток экспорта данных:

source: extension list is empty
ru_ru: лист расширений файлов пуст

source: FillData:
ru_ru: Заполнение данных:

source: Find All installed executable
ru_ru: Найти все инсталлированные VCS

source: GetData:
ru_ru: Получение данных:

# GetData_input_variable_is_empt
source: input data is empty
ru_ru: входные данные пусты и не могут быть обработанны

# input_exec_path_is_empty_abort
source: path to VCS binary file is empty
ru_ru: путь к исполняемому файлу VCS не указан

# input_VCS_url_is_empty_abort
source: enter URL or Path to repository
ru_ru: введите URL или путь к репозиторию

source: list
ru_ru: список

source: Load {0} complete
ru_ru: Репозиторий {0} успешно загружен

source: Load repo: {0} ..
ru_ru: Загрузка репозитория: {0} ..

source: no files selected, abort
ru_ru: невыбраны файлы для списка

source: no items from repo list
ru_ru: список элементов репозитория пуст

source: NONE
ru_ru: НЕТ

source: not supported VCS operation
ru_ru: выбранная VCS не поддерживает текущую операцию

source: Operation Cancelled
ru_ru: Операция прервана

source: Operation fault
ru_ru: Операция закончилась неудачно..

# Output_split_list_repository_f
source: Output 'split list' repository file name
ru_ru: Имя файл листа в репозитории

# PageSetup
source: Setup
ru_ru: Настройки

source: path or url to repository
ru_ru: путь или URL-адрес репозитория

# Remove_to
source: UnSelected to
ru_ru: Отменить выбор:

source: Remove VCS binary
ru_ru: Удалить путь

source: Search VCS binary
ru_ru: Найти путь

source: Select executable files
ru_ru: Выбор исполняемых фйлов

source: Select VCS binary
ru_ru: Добавить путь

# select_VCS_type_for_request
source: select before VCS type: svn | git | hg
ru_ru: не выбран тип VCS: svn | git | hg

source: settings
ru_ru: настройки

source: SPCH List Builder
ru_ru: SPCH генератор списка

# Type_Uri_not_validate_use_path
source: Type Uri not validate, use path to directory or Url
ru_ru: Неверный тип Uri, укажите директорию или Url

# Uri_is_empty
source: repo Uri is empty
ru_ru: Адрес репозитория пуст

# Uri_or_Path_is_empty
source: repo URL or Path is missing
ru_ru: URL или путь к репозиторию не указаны

source: VCS binary path:
ru_ru: путь к исполняемым файлам VCS

source: VCS executable files (
ru_ru: VCS исполняемый фйл (

source: VCS return:
ru_ru: {0} - выполнение:

source: VCS type not selected, abort
ru_ru: невыбран тип VCS
